src/InformationRegisters/НастройкаШаблоновБизнесПроцессов/НастройкаШаблоновБизнесПроцессов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НастройкаШаблоновБизнесПроцессов</name>
  <resources>
    <name>ЗапрещеноИзменение</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ИнтерактивныйЗапуск</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ВидИнтерактивногоСобытия</name>
    <type>
      <types>EnumRef.ВидыИнтерактивныхДействий</types>
    </type>
  </resources>
  <resources>
    <name>СобытияАвтоСтарта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>КомуНазначен</name>
    <type>
      <types>CatalogRef.ВидыВнутреннихДокументов</types>
      <types>CatalogRef.ВидыВходящихДокументов</types>
      <types>CatalogRef.ВидыИсходящихДокументов</types>
      <types>CatalogRef.ИдентификаторыОбъектовМетаданных</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ШаблонБизнесПроцесса</name>
    <type>
      <types>CatalogRef.ШаблоныУтверждения</types>
      <types>CatalogRef.ШаблоныОзнакомления</types>
      <types>CatalogRef.ШаблоныСоставныхБизнесПроцессов</types>
      <types>CatalogRef.ШаблоныРассмотрения</types>
      <types>CatalogRef.ШаблоныСогласования</types>
      <types>CatalogRef.ШаблоныПоручения</types>
      <types>CatalogRef.ШаблоныКомплексныхБизнесПроцессов</types>
      <types>CatalogRef.ШаблоныПриглашения</types>
      <types>CatalogRef.ШаблоныИсполнения</types>
      <types>CatalogRef.ШаблоныРегистрации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Условие</name>
    <type>
      <types>CatalogRef.УсловияМаршрутизации</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/КоличествоНастроекШаблоновПроцессов/КоличествоНастроекШаблоновПроцессов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КоличествоНастроекШаблоновПроцессов</name>
  <resources>
    <name>КоличествоНастроек</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ШаблонПроцесса</name>
    <type>
      <types>CatalogRef.ШаблоныУтверждения</types>
      <types>CatalogRef.ШаблоныОзнакомления</types>
      <types>CatalogRef.ШаблоныСоставныхБизнесПроцессов</types>
      <types>CatalogRef.ШаблоныРассмотрения</types>
      <types>CatalogRef.ШаблоныСогласования</types>
      <types>CatalogRef.ШаблоныПоручения</types>
      <types>CatalogRef.ШаблоныКомплексныхБизнесПроцессов</types>
      <types>CatalogRef.ШаблоныПриглашения</types>
      <types>CatalogRef.ШаблоныИсполнения</types>
      <types>CatalogRef.ШаблоныРегистрации</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/НастройкаШаблоновБизнесПроцессов/RecordSetModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий

Процедура ПриЗаписи(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ЭтотОбъект.Количество() <> 0 Тогда
		Для Каждого Запись Из ЭтотОбъект Цикл
			РегистрыСведений.КоличествоНастроекШаблоновПроцессов.ОбновитьСведенияПоШаблону(
				Запись.ШаблонБизнесПроцесса);
		КонецЦикла;	
	Иначе		
		
		ШаблонПроцесса = Отбор.ШаблонБизнесПроцесса.Значение;
		
		Если ЗначениеЗаполнено(ШаблонПроцесса)
			И ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ШаблонПроцесса, "Ссылка") <> Неопределено Тогда
		
			РегистрыСведений.КоличествоНастроекШаблоновПроцессов.ОбновитьСведенияПоШаблону(
				ШаблонПроцесса);
				
		КонецЕсли;		
		
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
